package com.example.snotra;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

public class ExpandableListData {
    public static HashMap<String, List<String>> getData(){
    HashMap<String, List<String>> expandableListDetail = new HashMap<String, List<String>>();

    List <String> cut = new ArrayList<String>();
    cut.add("ВАЖНО! Нужно обратиться к медицинскому специалисту, если\n" +
            "•\tКровь пульсирует \n" +
            "•\tКровотечение не прекращается после 10 минут надавливания.\n" +
            "•\tПорез очень большой или очень глубокий, или может потребоваться наложение швов (см. ниже).\n" +
            "•\tСуществует вероятность того, что были затронуты нервы или сухожилия.\n" +
            "•\tВы впадаете в шок (смотрите ниже)\n" +
            "•\tТравма приходится на сустав – это может вызвать длительные трудности с передвижением.\n" +
            "•\tЧто-то застряло в ране.\n" +
            "•\tПорез затрагивает рот, лицо, ладони рук и/или пальцы или гениталии.\n" +
            "•\tПорез не заживает должным образом.\n" +
            "•\tПорез имеет признаки инфекции (он красный, воспаленный или болезненный, твердый или из него сочится гной).\n");
    cut.add("Маленький порез/царапина/ссадина:\n" +
            "1)\tВымойте руки с мылом\n" +
            "2)\tПромойте рану проточной водой (избегайте использования антисептических лосьонов или кремов).\n" +
            "3)\tПромокните участок насухо чистым, не пушистым материалом.\n" +
            "4)\tПолностью закройте порез стерильной повязкой или пластырем.\n");
    cut.add("Для большого кровотечения:\n" +
            "1)\tПриложите прямое давление к ране, используя чистый, не пушистый тампон или ткань. Прикладывайте давление в течение 10 минут и не поднимайте тампон, чтобы посмотреть.\n" +
            "2)\tПоднимите поврежденную область (если она не сломана) выше уровня сердца, чтобы замедлить кровотечение.\n" +
            "3)\tПлотно забинтуйте тампон или повязку, чтобы остановить кровотечение, но не настолько туго, чтобы это остановило кровообращение в пальцах.\n" +
            "4)\tНе снимайте бинты, так как это может помешать свертыванию крови (когда ваши кровяные тельца сворачиваются вместе, чтобы запечатать рану). Если кровотечение просачивается через первую повязку, накройте вторым бинтом. Если кровотечение продолжает просачиваться, снимите вторую повязку и наложите повторно.\n" +
            "5)\tЕсли вы потеряете много крови, у вас может наступить шок. Это может быть очень серьезно и требует медицинской помощи (смотрите ниже).\n");
    cut.add("Если что-то застряло в ране:\n" +
            "1)\tОставьте его на месте – не пытайтесь вытащить, так как это может вызвать дальнейшее кровотечение.\n" +
            "2)\tПо возможности приподнимите часть тела (если она не сломана) выше уровня сердца, чтобы замедлить кровотечение.\n" +
            "3)\tЕсли можете, плотно сдвиньте края раны, чтобы попытаться остановить кровопотерю.\n" +
            "4)\tАккуратно накройте рану и предмет стерильной повязкой, если это возможно.\n");
    cut.add("Когда нужны швы:\n" +
            "1)\t Не останавливается кровотечение\n" +
            "2)\tДлина раны больше 1 см.\n" +
            "3)\tПорез открытый (т.е. края не сходятся, и вы можете видеть ткани).\n");

    List <String> burn = new ArrayList<String>();
    burn.add("ВАЖНО! Нужно обратиться к медицинскому специалисту, если\n" +
            "•\tОжог больше ладони, болезненный, обугленный (белый) или кажется, что становится хуже.\n" +
            "•\tОжог на лице, руках, гениталиях или на суставах – ожоги этих областей могут вызвать долговременные проблемы с передвижением.\n" +
            "•\tОжог химический или электрический.\n");
    burn.add("Ожог небольшой:\n" +
            "1)\tПодержите ожог под холодной, медленной проточной водой в течение 10 минут.\n" +
            "2)\tХимические ожоги, например, от сильных чистящих средств, следует промывать под холодной, медленной проточной водой в течение 20 минут. Никогда не пытайтесь нейтрализовать химическое вещество, добавляя кислотное химическое вещество к щелочному химическому веществу или наоборот – вместо этого обратитесь за консультацией к врачу.\n" +
            "3)\tЕсли вы можете легко снять украшения или одежду в области ожога, сделайте это осторожно. Обожженный участок может опухнуть и/или стать липким и прилипнуть к одежде или ювелирные изделия. Если одежда или украшения уже прилипли к ожогу или их невозможно снять, не прикасаясь к ожогу, оставьте их в покое и обратитесь к врачу.\n" +
            "4)\tНе наносите никаких кремов, масел, смазок, мазей, клейких повязок или ваты. Пищевую пленку можно использовать, чтобы неплотно прикрыть ожог и предотвратить заражение.\n" +
            "5)\tЕсли ожог болезненный, может помочь прием болеутоляющих средств (согласно инструкции)\n" +
            "6)\tНикогда не трогайте ожог и не вскрывайте волдыри – это задержит заживление.\n");

    List <String> bruise = new ArrayList<String>();
    bruise.add("ВАЖНО! Нужно обратиться к врачу, если ушиб серьезный, затрагивает голову, грудную клетку, живот или позвоночник");
    bruise.add("Ушиб небольшой\n" +
            "1)\tПриложить лед или что-то холодное на место ушиба, это уменьшит отек и снизит боль\n" +
            "2)\tПри наличии ссадины или царапины на поверхности кожи – промыть проточной водой, можно обработать антисептиком.\n");
    bruise.add("Ушиб большой\n" +
            "1)\tОбездвижить поврежденный участок и приложить лед или что-то холодное\n" +
            "2)\tНаложить давящую повязку чуть выше области повреждения\n" +
            "3)\tОбязательно обратиться в травмпункт\n");

    List <String> scar = new ArrayList<String>();
    scar.add("•\tШрамы с большей вероятностью образуются в областях суставов, таких как колени и локти.\n" +
            "•\tИнфицированные раны с большей вероятностью приведут к образованию рубцов - старайтесь содержать рану в чистоте.\n" +
            "•\tПластыри для закрытия кожи и клейкие полоски могут помочь сохранить некоторые раны закрытыми, что может помочь предотвратить дальнейшее образование рубцов.\n" +
            "•\tНе трогайте, не ковыряйте рану, это препятствует естественному заживлению и, вероятно, усугубит рубцы.\n" +
            "•\tМожно использовать силиконовые гелевые прокладки и лосьоны, содержащие витамины Е и А, которые помогают заживлению шрамов\n");
    scar.add("•\tТакже защищайте область шрама от загара, так как из-за ультрафиолетовых лучей шрамы могут темнеть\n" +
            "•\tОбратитесь к врачу: дерматологу, специалист может подсказать, возможно ли удалить шрам и подобрать наиболее подходящий метод (криотерапия, лазерная терапия, использование филлеров и т.п.)\n" +
            "•\tЕсли вы хотите перекрыть шрамы татуировкой, нужно подождать заживления шрама, иначе рубец может только усугубиться. Татуировки на шрамах сложнее, чем на чистой коже, поэтому важно подобрать хорошего тату-мастера, работающего с перекрытием шрамов.\n");

    List <String> shock = new ArrayList<String>();
    shock.add("Симптомы:\n" +
            "•\tУчащенный, слабый пульс.\n" +
            "•\tОщущение дурноты, головокружения, слабости или тошноты.\n" +
            "•\tУчащенное, неглубокое дыхание.\n" +
            "•\tСиние губы\n" +
            "•\tХолодная, липкая кожа\n");
    shock.add("Если вы испытываете какие–либо из этих симптомов, обратитесь за срочной помощью - позвоните по номеру 103 или 112, сообщите им подробности и:");
    shock.add("1)\tЛягте ровно и поднимите ноги как минимум на 25 см или 10 дюймов, чтобы помочь восстановить кровяное давление.\n" +
            "2)\t Продолжайте оказывать прямое давление на любую кровоточащую рану.\n" +
            "3)\tОслабьте тесную одежду и сохраняйте тепло с помощью нескольких слоев одеял.\n" +
            "4)\tНе пытайтесь есть или пить – это может вызвать рвоту.\n" +
            "5)\tПодумайте о том, чтобы оставить дверь незапертой, чтобы к вам могли войти, если вы потеряете сознание.\n");

    List <String> care = new ArrayList<String>();
    care.add("\n" +
            "•\tПейте достаточно жидкости, чтобы восполнить потерю крови. Если вы делаете это и все еще испытываете головокружение, когда встаете, обратитесь к врачу.\n" +
            "•\tСледуйте советам медицинского персонала\n" +
            "•\tОбратитесь за дополнительной медицинской помощью, если вы заметили какие-либо признаки инфекции (если рана красная, воспаленная, болезненная, твердая или из нее сочится гной, или если у вас высокая температура).\n" +
            "•\tПо возможности, дайте себе немного отдохнуть. Позаботьтесь о своём ментальном состоянии, обеспечьте себя комфортом, попросите помощи у близких или запишитесь в группу поддержки.\n");

    List <String> kit = new ArrayList<String>();
    kit.add("Содержимое аптечки может зависеть от того, какой вид самоповреждения. Общие рекомендации:");
    kit.add("1)\tБинты, пластыри, стерильные перевязочные материалы\n" +
            "2)\tКлейкие полоски для закрытия кожи (например, стерильные полоски)\n" +
            "3)\tКлейкая лента для закрепления повязок и ножницы\n" +
            "4)\tАнтисептический спрей или салфетки\n" +
            "5)\tОбезболивающее\n");


    expandableListDetail.put("Порез",cut);
    expandableListDetail.put("Ожог",burn);
    expandableListDetail.put("Ушиб",bruise);
    expandableListDetail.put("Шок",shock);
    expandableListDetail.put("Забота",care);
    expandableListDetail.put("Аптечка",kit);
    expandableListDetail.put("Шрамы",scar);
    return expandableListDetail;
    }
}
