package com.example.snotra;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

public class ExpandableListData {
    public static HashMap<String, List<String>> getData(){
    HashMap<String, List<String>> expandableListDetail = new HashMap<String, List<String>>();
    List <String> cut = new ArrayList<String>();
    cut.add("ВАЖНО! нужно обратиться к врачу, если: •\tКровь пульсирует \n" +
            "•\tКровотечение не прекращается после 10 минут надавливания.\n" +
            "•\tПорез очень большой или очень глубокий, или может потребоваться наложение швов (см. ниже).\n" +
            "•\tСуществует вероятность того, что были затронуты нервы или сухожилия.\n" +
            "•\tВы впадаете в шок (смотрите ниже)\n" +
            "•\tТравма приходится на сустав – это может вызвать длительные трудности с передвижением.\n" +
            "•\tЧто-то застряло в ране.\n" +
            "•\tПорез затрагивает рот, лицо, ладони рук и/или пальцы или гениталии.\n" +
            "•\tПорез не заживает должным образом.\n" +
            "•\tПорез имеет признаки инфекции (он красный, воспаленный или болезненный, твердый или из него сочится гной).\n");
    cut.add("Когда нужны швы:\n" +
            "1)\t Не останавливается кровотечение\n" +
            "2)\tДлина раны больше 1 см.\n" +
            "3)\tПорез открытый (т.е. края не сходятся, и вы можете видеть ткани).\n");
    cut.add("Маленький порез/царапина/ссадина:\n" +
            "1)\tВымойте руки с мылом\n" +
            "2)\tПромойте рану проточной водой (избегайте использования антисептических лосьонов или кремов).\n" +
            "3)\tПромокните участок насухо чистым, не пушистым материалом.\n" +
            "4)\tПолностью закройте порез стерильной повязкой или пластырем.\n");
    cut.add("Для большого кровотечения:\n" +
            "1)\tПриложите прямое давление к ране, используя чистый, не пушистый тампон или ткань. Прикладывайте давление в течение 10 минут и не поднимайте тампон, чтобы посмотреть.\n" +
            "2)\tПоднимите поврежденную область (если она не сломана) выше уровня сердца, чтобы замедлить кровотечение.\n" +
            "3)\tПлотно забинтуйте тампон или повязку, чтобы остановить кровотечение, но не настолько туго, чтобы это остановило кровообращение в пальцах.\n" +
            "4)\tНе снимайте бинты, так как это может помешать свертыванию крови (когда ваши кровяные тельца сворачиваются вместе, чтобы запечатать рану). Если кровотечение просачивается через первую повязку, накройте вторым бинтом. Если кровотечение продолжает просачиваться, снимите вторую повязку и наложите повторно.\n" +
            "5)\tЕсли вы потеряете много крови, у вас может наступить шок. Это может быть очень серьезно и требует медицинской помощи (смотрите ниже).\n");
    cut.add("Если что-то застряло в ране:\n" +
            "1)\tОставьте его на месте – не пытайтесь вытащить, так как это может вызвать дальнейшее кровотечение.\n" +
            "2)\tПо возможности приподнимите часть тела (если она не сломана) выше уровня сердца, чтобы замедлить кровотечение.\n" +
            "3)\tЕсли можете, плотно сдвиньте края раны, чтобы попытаться остановить кровопотерю.\n" +
            "4)\tАккуратно накройте рану и предмет стерильной повязкой, если это возможно.\n");

    expandableListDetail.put("Порез",cut);
    return expandableListDetail;
    }
}
